In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
import pandas as pd

In [5]:
empdata = [[101,'keshav',50000],[102,'madhav',60000],[103,'rakesh',70000]]

In [ ]:
#creating dataframe from list of list

In [6]:
df = pd.DataFrame(empdata)

In [7]:
df

     0       1      2
0  101  keshav  50000
1  102  madhav  60000
2  103  rakesh  70000

In [8]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\user\anaconda3\lib\site-packages (1.1.2)

In [9]:
import pymysql

In [10]:
conn = pymysql.connect(host='localhost',
                      user = 'root',
                      password = 'root',
                      port = 3306,
                      database = 'depractice'
                     )

In [11]:
cur = conn.cursor()

In [12]:
cur.execute("select * from emp")

3

In [13]:
data = cur.fetchall()

In [14]:
data

((101, 'rakesh'), (102, 'madhav'), (103, 'atul'))

In [ ]:
#it came as tuple of tuple from mysql database depractive emp table

In [ ]:
#to convert it into dataframe

In [15]:
df = pd.DataFrame(data)

In [16]:
df

     0       1
0  101  rakesh
1  102  madhav
2  103    atul

In [ ]:
#to set the column name

In [20]:
df = pd.DataFrame(data,columns=['id','name'])

In [21]:
df

    id    name
0  101  rakesh
1  102  madhav
2  103    atul

In [ ]:
#DATAFRAME creation using dictionary

In [22]:
student_iq = {
    'name': ['aka','biv','kau'],
    'id': [100,101,102],
    'iq': [80, 90,100]
}

In [24]:
students=pd.DataFrame(student_iq)

In [25]:
students

  name   id   iq
0  aka  100   80
1  biv  101   90
2  kau  102  100

In [ ]:
#tuple of tuple - DF create

In [26]:
player_cat = (('rohit', 10000, 'mumbai'),('virat', 12000, 'delhi'),('yuvi',9000,'punjab'))

In [27]:
category = pd.DataFrame(player_cat)

In [28]:
category

       0      1       2
0  rohit  10000  mumbai
1  virat  12000   delhi
2   yuvi   9000  punjab

In [30]:
category = pd.DataFrame(player_cat,columns=['name','runs','city'])

In [31]:
category

    name   runs    city
0  rohit  10000  mumbai
1  virat  12000   delhi
2   yuvi   9000  punjab

In [ ]:
#list of tuple -creation

In [32]:
play = [('rohit', 10000, 'mumbai'),('virat', 12000, 'delhi'),('yuvi',9000,'punjab')]

In [33]:
pd.DataFrame(play)

       0      1       2
0  rohit  10000  mumbai
1  virat  12000   delhi
2   yuvi   9000  punjab

In [35]:
pd.DataFrame(play,columns=['name','matches','address'])

    name  matches address
0  rohit    10000  mumbai
1  virat    12000   delhi
2   yuvi     9000  punjab

In [ ]:
#tuple of list -creation DF

In [36]:
cric = (['rohit', 10000, 'mumbai'],['virat', 12000, 'delhi'],['yuvi',9000,'punjab'])

In [37]:
pd.DataFrame(cric)

       0      1       2
0  rohit  10000  mumbai
1  virat  12000   delhi
2   yuvi   9000  punjab

In [39]:
pd.DataFrame(cric,columns=['player','balls_played','venue'])

  player  balls_played   venue
0  rohit         10000  mumbai
1  virat         12000   delhi
2   yuvi          9000  punjab

In [ ]:
#From File - using read_csv

In [40]:
pd.read_csv("emprecords.csv")

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  rakesh  23432432
3  104    amit    432432

In [50]:
pd.read_csv(r"C:\Users\USER\Desktop\Data Engineering\SQL practice_Campusx\Pandas data sets\batsman_runs_ipl.csv")

             batter  batsman_run
0    A Ashish Reddy          280
1          A Badoni          161
2        A Chandila            4
3          A Chopra           53
4       A Choudhary           25
..              ...          ...
600      Yash Dayal            0
601   Yashpal Singh           47
602     Younis Khan            3
603    Yuvraj Singh         2754
604          Z Khan          117

[605 rows x 2 columns]

In [55]:
pd.read_csv("C:\\Users\\USER\\Desktop\\Data Engineering\\SQL practice_Campusx\\Pandas data sets\\movies (1).csv")

,title_x,imdb_id,poster_path,wiki_link,title_y,original_title,is_adult,year_of_release,runtime,genres,imdb_rating,imdb_votes,story,summary,tagline,actors,wins_nominations,release_date
0,Uri: The Surgical Strike,tt8291224,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Uri:_The_Surgica...,Uri: The Surgical Strike,Uri: The Surgical Strike,0,2019,138,Action|Drama|War,8.4,35112,Divided over five chapters the film chronicle...,Indian army special forces execute a covert op...,NaN,Vicky Kaushal|Paresh Rawal|Mohit Raina|Yami Ga...,4 wins,11 January 2019 (USA)
1,Battalion 609,tt9472208,NaN,https://en.wikipedia.org/wiki/Battalion_609,Battalion 609,Battalion 609,0,2019,131,War,4.1,73,The story revolves around a cricket match betw...,The story of Battalion 609 revolves around a c...,NaN,Vicky Ahuja|Shoaib Ibrahim|Shrikant Kamat|Elen...,NaN,11 January 2019 (India)
2,The Accidental Prime Minister (film),tt6986710,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/The_Accidental_P...,The Accidental Prime Minister,The Accidental Prime Minister,0,2019,112,Biography|Drama,6.1,5549,Based on the memoir by Indian policy analyst S...,Explores Manmohan Singh's tenure as the Prime ...,NaN,Anupam Kher|Akshaye Khanna|Aahana Kumra|Atul S...,NaN,11 January 2019 (USA)
3,Why Cheat India,tt8108208,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Why_Cheat_India,Why Cheat India,Why Cheat India,0,2019,121,Crime|Drama,6.0,1891,The movie focuses on existing malpractices in ...,The movie focuses on existing malpractices in ...,NaN,Emraan Hashmi|Shreya Dhanwanthary|Snighdadeep ...,NaN,18 January 2019 (USA)
4,Evening Shadows,tt6028796,NaN,https://en.wikipedia.org/wiki/Evening_Shadows,Evening Shadows,Evening Shadows,0,2018,102,Drama,7.3,280,While gay rights and marriage equality has bee...,Under the 'Evening Shadows' truth often plays...,NaN,Mona Ambegaonkar|Ananth Narayan Mahadevan|Deva...,17 wins & 1 nomination,11 January 2019 (India)
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1624,Tera Mera Saath Rahen,tt0301250,https://upload.wikimedia.org/wikipedia/en/2/2b...,https://en.wikipedia.org/wiki/Tera_Mera_Saath_...,Tera Mera Saath Rahen,Tera Mera Saath Rahen,0,2001,148,Drama,4.9,278,Raj Dixit lives with his younger brother Rahu...,A man is torn between his handicapped brother ...,NaN,Ajay Devgn|Sonali Bendre|Namrata Shirodkar|Pre...,NaN,7 November 2001 (India)
1625,Yeh Zindagi Ka Safar,tt0298607,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Yeh_Zindagi_Ka_S...,Yeh Zindagi Ka Safar,Yeh Zindagi Ka Safar,0,2001,146,Drama,3.0,133,Hindi pop-star Sarina Devan lives a wealthy ...,A singer finds out she was adopted when the ed...,NaN,Ameesha Patel|Jimmy Sheirgill|Nafisa Ali|Gulsh...,NaN,16 November 2001 (India)
1626,Sabse Bada Sukh,tt0069204,NaN,https://en.wikipedia.org/wiki/Sabse_Bada_Sukh,Sabse Bada Sukh,Sabse Bada Sukh,0,2018,\N,Comedy|Drama,6.1,13,Village born Lalloo re-locates to Bombay and ...,Village born Lalloo re-locates to Bombay and ...,NaN,Vijay Arora|Asrani|Rajni Bala|Kumud Damle|Utpa...,NaN,NaN
1627,Daaka,tt10833860,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Daaka,Daaka,Daaka,0,2019,136,Action,7.4,38,Shinda tries robbing a bank so he can be wealt...,Shinda tries robbing a bank so he can be wealt...,NaN,Gippy Grewal|Zareen Khan|,NaN,1 November 2019 (USA)
1628,Humsafar,tt2403201,https://upload.wikimedia.org/wikipedia/en/thum...,https://en.wikipedia.org/wiki/Humsafar,Humsafar,Humsafar,0,2011,35,Drama|Romance,9.0,2968,Sara and Ashar are childhood friends who share...,Ashar and Khirad are forced to get married due...,NaN,Fawad Khan|,NaN,TV Series (2011–2012)

In [56]:
pd.read_csv("C:/Users/USER/Desktop/Data Engineering/SQL practice_Campusx/Pandas data sets/diabetes.csv")

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [60]:
pd.read_csv(r"C:\Users\USER\Desktop\Data Engineering\SQL practice_Campusx\Pandas data sets\diabetes.csv",usecols=['Pregnancies','Glucose','BloodPressure'])

     Pregnancies  Glucose  BloodPressure
0              6      148             72
1              1       85             66
2              8      183             64
3              1       89             66
4              0      137             40
..           ...      ...            ...
763           10      101             76
764            2      122             70
765            5      121             72
766            1      126             60
767            1       93             70

[768 rows x 3 columns]

In [61]:
pd.read_csv(r"C:\Users\USER\Desktop\Data Engineering\SQL practice_Campusx\Pandas data sets\batsman_runs_ipl.csv",usecols=['batter'])

             batter
0    A Ashish Reddy
1          A Badoni
2        A Chandila
3          A Chopra
4       A Choudhary
..              ...
600      Yash Dayal
601   Yashpal Singh
602     Younis Khan
603    Yuvraj Singh
604          Z Khan

[605 rows x 1 columns]

In [ ]:
#read Json file

In [63]:
pd.read_json(r"C:\Users\USER\Desktop\AI Nexus\Pandas\Notes\sample_data.json")

   id     name  age       city
0   1    Alice   25      Delhi
1   2      Bob   30     Mumbai
2   3  Charlie   28    Kolkata
3   4    David   35  Bengaluru
4   5      Eva   22    Chennai
5   6    Frank   40  Hyderabad
6   7    Grace   27       Pune
7   8    Helen   32     Jaipur
8   9      Ian   29  Ahmedabad
9  10     Jane   26   Guwahati

In [15]:
import pandas as pd

In [5]:
pd.read_json(r"C:\Users\USER\Desktop\AI Nexus\Pandas\Notes\emp.json")

                                           Employees
0  {'userId': 'rirani', 'jobTitleName': 'Develope...
1  {'userId': 'nirani', 'jobTitleName': 'Develope...
2  {'userId': 'thanks', 'jobTitleName': 'Program ...

In [7]:
import json
with open (r"C:\Users\USER\Desktop\AI Nexus\Pandas\Notes\emp.json") as fp:
    data = json.load(fp)

In [8]:
data

{'Employees': [{'userId': 'rirani',
   'jobTitleName': 'Developer',
   'firstName': 'Romin',
   'lastName': 'Irani',
   'preferredFullName': 'Romin Irani',
   'employeeCode': 'E1',
   'region': 'CA',
   'phoneNumber': '408-1234567',
   'emailAddress': 'romin.k.irani@gmail.com'},
  {'userId': 'nirani',
   'jobTitleName': 'Developer',
   'firstName': 'Neil',
   'lastName': 'Irani',
   'preferredFullName': 'Neil Irani',
   'employeeCode': 'E2',
   'region': 'CA',
   'phoneNumber': '408-1111111',
   'emailAddress': 'neilrirani@gmail.com'},
  {'userId': 'thanks',
   'jobTitleName': 'Program Directory',
   'firstName': 'Tom',
   'lastName': 'Hanks',
   'preferredFullName': 'Tom Hanks',
   'employeeCode': 'E3',
   'region': 'CA',
   'phoneNumber': '408-2222222',
   'emailAddress': 'tomhanks@gmail.com'}]}

In [12]:
data['Employees']

[{'userId': 'rirani',
  'jobTitleName': 'Developer',
  'firstName': 'Romin',
  'lastName': 'Irani',
  'preferredFullName': 'Romin Irani',
  'employeeCode': 'E1',
  'region': 'CA',
  'phoneNumber': '408-1234567',
  'emailAddress': 'romin.k.irani@gmail.com'},
 {'userId': 'nirani',
  'jobTitleName': 'Developer',
  'firstName': 'Neil',
  'lastName': 'Irani',
  'preferredFullName': 'Neil Irani',
  'employeeCode': 'E2',
  'region': 'CA',
  'phoneNumber': '408-1111111',
  'emailAddress': 'neilrirani@gmail.com'},
 {'userId': 'thanks',
  'jobTitleName': 'Program Directory',
  'firstName': 'Tom',
  'lastName': 'Hanks',
  'preferredFullName': 'Tom Hanks',
  'employeeCode': 'E3',
  'region': 'CA',
  'phoneNumber': '408-2222222',
  'emailAddress': 'tomhanks@gmail.com'}]

In [16]:
pd.DataFrame(data['Employees'])

,userId,jobTitleName,firstName,lastName,preferredFullName,employeeCode,region,phoneNumber,emailAddress
0,rirani,Developer,Romin,Irani,Romin Irani,E1,CA,408-1234567,romin.k.irani@gmail.com
1,nirani,Developer,Neil,Irani,Neil Irani,E2,CA,408-1111111,neilrirani@gmail.com
2,thanks,Program Directory,Tom,Hanks,Tom Hanks,E3,CA,408-2222222,tomhanks@gmail.com

In [ ]:
# Assignment - nested json to DataFrame

In [17]:
data = """
{
  "orders": [
    {
      "order_id": "ORD1001",
      "customer": {
        "name": "John Doe",
        "contact": {
          "email": "john@example.com",
          "phone": "9876543210"
        }
      },
      "items": [
        {"item_id": "I101", "name": "Laptop", "price": 60000, "qty": 1},
        {"item_id": "I102", "name": "Mouse", "price": 1200, "qty": 2}
      ],
      "shipping": {
        "address": "Baner, Pune",
        "method": "Express",
        "tracking": {
          "carrier": "Bluedart",
          "tracking_id": "BD12345IN"
        }
      }
    },
    {
      "order_id": "ORD1002",
      "customer": {
        "name": "Arjun Singh",
        "contact": {
          "email": "arjun@example.com",
          "phone": "9988776655"
        }
      },
      "items": [
        {"item_id": "I103", "name": "Keyboard", "price": 2500, "qty": 1}
      ],
      "shipping": {
        "address": "Salt Lake, Kolkata",
        "method": "Standard",
        "tracking": {
          "carrier": "Delhivery",
          "tracking_id": "DL99887IN"
        }
      }
    }
  ]
}
"""

In [19]:
data = json.loads(data)

In [20]:
data

{'orders': [{'order_id': 'ORD1001',
   'customer': {'name': 'John Doe',
    'contact': {'email': 'john@example.com', 'phone': '9876543210'}},
   'items': [{'item_id': 'I101', 'name': 'Laptop', 'price': 60000, 'qty': 1},
    {'item_id': 'I102', 'name': 'Mouse', 'price': 1200, 'qty': 2}],
   'shipping': {'address': 'Baner, Pune',
    'method': 'Express',
    'tracking': {'carrier': 'Bluedart', 'tracking_id': 'BD12345IN'}}},
  {'order_id': 'ORD1002',
   'customer': {'name': 'Arjun Singh',
    'contact': {'email': 'arjun@example.com', 'phone': '9988776655'}},
   'items': [{'item_id': 'I103', 'name': 'Keyboard', 'price': 2500, 'qty': 1}],
   'shipping': {'address': 'Salt Lake, Kolkata',
    'method': 'Standard',
    'tracking': {'carrier': 'Delhivery', 'tracking_id': 'DL99887IN'}}}]}

In [21]:
pd.DataFrame(data)

                                              orders
0  {'order_id': 'ORD1001', 'customer': {'name': '...
1  {'order_id': 'ORD1002', 'customer': {'name': '...

In [ ]:
# From API

In [22]:
pd.read_json("https://dummy-json.mock.beeceptor.com/continents")

,code,name,areaSqKm,population,lines,countries,oceans,developedCountries
0,AF,Africa,30370000,1340598000,"[Equator, Prime Meridian]",54,"[Atlantic Ocean, Indian Ocean]","[South Africa, Egypt, Nigeria]"
1,AN,Antarctica,14000000,1000,"[Antarctic Circle, 180th Meridian]",0,[Southern Ocean],[]
2,AS,Asia,44579000,4641055000,"[Equator, Tropic of Cancer]",49,"[Indian Ocean, Pacific Ocean]","[Japan, South Korea, Singapore, United Arab Em..."
3,EU,Europe,10180000,747636000,"[Prime Meridian, Arctic Circle]",44,"[Atlantic Ocean, Arctic Ocean]","[Germany, United Kingdom, France, Italy, Spain]"
4,NA,North America,24709000,579750000,"[Tropic of Cancer, Arctic Circle]",23,"[Atlantic Ocean, Pacific Ocean, Arctic Ocean]","[United States, Canada, Mexico]"
5,OC,Oceania,8500000,43155000,"[Tropic of Capricorn, 180th Meridian]",14,[Pacific Ocean],"[Australia, New Zealand]"
6,SA,South America,17840000,426768000,"[Equator, Tropic of Capricorn]",12,"[Atlantic Ocean, Pacific Ocean]","[Brazil, Argentina, Chile]"

In [23]:
api_data = pd.read_json("https://dummy-json.mock.beeceptor.com/continents")

In [24]:
api_data

,code,name,areaSqKm,population,lines,countries,oceans,developedCountries
0,AF,Africa,30370000,1340598000,"[Equator, Prime Meridian]",54,"[Atlantic Ocean, Indian Ocean]","[South Africa, Egypt, Nigeria]"
1,AN,Antarctica,14000000,1000,"[Antarctic Circle, 180th Meridian]",0,[Southern Ocean],[]
2,AS,Asia,44579000,4641055000,"[Equator, Tropic of Cancer]",49,"[Indian Ocean, Pacific Ocean]","[Japan, South Korea, Singapore, United Arab Em..."
3,EU,Europe,10180000,747636000,"[Prime Meridian, Arctic Circle]",44,"[Atlantic Ocean, Arctic Ocean]","[Germany, United Kingdom, France, Italy, Spain]"
4,NA,North America,24709000,579750000,"[Tropic of Cancer, Arctic Circle]",23,"[Atlantic Ocean, Pacific Ocean, Arctic Ocean]","[United States, Canada, Mexico]"
5,OC,Oceania,8500000,43155000,"[Tropic of Capricorn, 180th Meridian]",14,[Pacific Ocean],"[Australia, New Zealand]"
6,SA,South America,17840000,426768000,"[Equator, Tropic of Capricorn]",12,"[Atlantic Ocean, Pacific Ocean]","[Brazil, Argentina, Chile]"

In [31]:
apidata2 = pd.read_json("https://fake-json-api.mock.beeceptor.com/companies")

In [32]:
apidata2

,id,name,address,zip,country,employeeCount,industry,marketCap,domain,logo,ceoName
0,1,Moore Group,452 Waterloo Road,59721-2470,Jordan,5740,Technology,8513941452,burly-barge.info,https://example.com/logo1.png,Bryce Aufderhar
1,2,D&#x27;Amore - Robel,15671 The Paddocks,55452,Turks and Caicos Islands,2179,Technology,1036421812,marvelous-merit.name,https://example.com/logo1.png,Theo Farrell
2,3,"Stracke, Price and Homenick",770 Nannie Ports,61239,Myanmar,2512,Technology,6322764607,rapid-birdcage.biz,https://example.com/logo1.png,Tia Bogan
3,4,"Cassin, Gusikowski and Hane",13259 Domenico Prairie,18552,Eritrea,6042,Technology,3345241297,peaceful-harp.com,https://example.com/logo1.png,Weldon Kilback
4,4,Parisian - Morar,4259 Pinfold Lane,01690,Cyprus,9153,Technology,1338694479,super-utilization.info,https://example.com/logo1.png,Amiya White
5,5,"Russel, Yost and Bergstrom",5929 Lessie Junctions,41347-4164,Yemen,1820,Technology,5023889455,snarling-yarmulke.com,https://example.com/logo1.png,Christelle Anderson
6,6,Padberg - Roberts,9764 W Lake Street,17081-0082,Falkland Islands (Malvinas),6867,Technology,9788881411,handy-swim.info,https://example.com/logo1.png,Albertha Douglas
7,7,"Yost, Crist and Schultz",88993 W Oak Street,92898,Papua New Guinea,5670,Technology,8197069783,sick-railway.biz,https://example.com/logo1.png,Elza Witting
8,8,Berge - Weber,3208 Brakus Flats,07617-7575,Marshall Islands,3390,Technology,4103403646,inferior-commodity.org,https://example.com/logo1.png,Darien Marvin
9,9,"Donnelly, Boyer and Hauck",3122 Woodlands,99047,Saint Barthelemy,5430,Technology,5413448031,enchanted-plastic.biz,https://example.com/logo1.png,Leola Schneider
10,10,Upton - Marvin,73731 Audrey Spring,27489,Montserrat,2838,Technology,8809290415,remarkable-tectonics.info,https://example.com/logo1.png,Kirsten Gerlach

In [ ]:
# From html

In [34]:
dflist = pd.read_html("FIFA World Cup - Wikipedia.html")

In [35]:
dflist

[                                   0                                  1
 0                                NaN                                NaN
 1                       Organiser(s)                               FIFA
 2                            Founded                 1930; 95 years ago
 3                             Region                      International
 4                              Teams          32 (48 from 2026 onwards)
 5               Related competitions             FIFA Women's World Cup
 6                  Current champions              Argentina (3rd title)
 7                 Most championships                  Brazil (5 titles)
 8                            Website                  fifa.com/worldcup
 9  2026 FIFA World Cup qualification  2026 FIFA World Cup qualification,
                                                    0
 0                   Argentina, the current champions
 1                                        Tournaments
 2  1930 1934 1938 1950 1954 1958 1962 1966 1970 1...,
     0                                                  1
 0 NaN  This article needs to be updated. The reason g...,
                                        Confederation  Times hosted  \
 0                                      UEFA (Europe)            11
 1                           CONMEBOL (South America)             5
 2  CONCACAF (North and Central America and Caribb...             3
 3                                         AFC (Asia)             2
 4                                       CAF (Africa)             1
 5                                      OFC (Oceania)             0

                                                Hosts  \
 0  1934, Italy; 1938, France, 1954, Switzerland; ...
 1  1930, Uruguay; 1950, Brazil; 1962, Chile; 1978...
 2    1970, Mexico; 1986, Mexico; 1994, United States
 3             2002, South Korea & Japan; 2022, Qatar
 4                                 2010, South Africa
 5                                               none

                          Upcoming hosts
 0                2030, Spain & Portugal
 1                                   NaN
 2  2026, Canada, Mexico & United States
 3                    2034, Saudi Arabia
 4                         2030, Morocco
 5                                   NaN  ,
      0     1                              2   3   \
 0   Ed.  Year                          Hosts NaN
 1   Ed.  Year                          Hosts NaN
 2     1  1930                        Uruguay NaN
 3     2  1934                          Italy NaN
 4     3  1938                         France NaN
 5     –  1942                            NaN NaN
 6     –  1946                            NaN NaN
 7     4  1950                         Brazil NaN
 8     5  1954                    Switzerland NaN
 9     6  1958                         Sweden NaN
 10    7  1962                          Chile NaN
 11    8  1966                        England NaN
 12    9  1970                         Mexico NaN
 13   10  1974                   West Germany NaN
 14   11  1978                      Argentina NaN
 15   12  1982                          Spain NaN
 16   13  1986                         Mexico NaN
 17   14  1990                          Italy NaN
 18   15  1994                  United States NaN
 19   16  1998                         France NaN
 20   17  2002             South Korea  Japan NaN
 21   18  2006                        Germany NaN
 22   19  2010                   South Africa NaN
 23   20  2014                         Brazil NaN
 24   21  2018                         Russia NaN
 25   22  2022                          Qatar NaN
 26   23  2026  Canada  Mexico  United States NaN
 27   24  2030  Morocco  Portugal  Spain[n 3] NaN
 28   25  2034                   Saudi Arabia NaN
 29  NaN   NaN                            NaN NaN

                               4                             5   \
 0                          Final                         Final
 1                      Champions                         Score
 2                        Uruguay                           4–2
 3                          Italy                  2–1 (a.e.t.)
 4                          Italy                           4–2
 5   Not held due to World War II  Not held due to World War II
 6   Not held due to World War II  Not held due to World War II
 7                        Uruguay                      2–1[n 2]
 8                   West Germany                           3–2
 9                         Brazil                           5–2
 10                        Brazil                           3–1
 11                       England                  4–2 (a.e.t.)
 12                        Brazil                           4–1
 13                  West Germany                           2–1
 14                     Argentina                  3–1 (a.e.t.)
 15                         Italy                           3–1
 16                     Argentina                           3–2
 17                  West Germany                           1–0
 18                        Brazil          0–0 (a.e.t.) (3–2 p)
 19                        France                           3–0
 20                        Brazil                           2–0
 21                         Italy          1–1 (a.e.t.) (5–3 p)
 22                         Spain                  1–0 (a.e.t.)
 23                       Germany                  1–0 (a.e.t.)
 24                        France                           4–2
 25                     Argentina          3–3 (a.e.t.) (4–2 p)
 26                           NaN                           NaN
 27                           NaN                           NaN
 28                           NaN                           NaN
 29                           NaN                           NaN

                               6   7                             8   \
 0                          Final NaN           Third place playoff
 1                     Runners-up NaN                   Third place
 2                      Argentina NaN                 United States
 3                 Czechoslovakia NaN                       Germany
 4                        Hungary NaN                        Brazil
 5   Not held due to World War II NaN  Not held due to World War II
 6   Not held due to World War II NaN  Not held due to World War II
 7                         Brazil NaN                        Sweden
 8                        Hungary NaN                       Austria
 9                         Sweden NaN                        France
 10                Czechoslovakia NaN                         Chile
 11                  West Germany NaN                      Portugal
 12                         Italy NaN                  West Germany
 13                   Netherlands NaN                        Poland
 14                   Netherlands NaN                        Brazil
 15                  West Germany NaN                        Poland
 16                  West Germany NaN                        France
 17                     Argentina NaN                         Italy
 18                         Italy NaN                        Sweden
 19                        Brazil NaN                       Croatia
 20                       Germany NaN                        Turkey
 21                        France NaN                       Germany
 22                   Netherlands NaN                       Germany
 23                     Argentina NaN                   Netherlands
 24                       Croatia NaN                       Belgium
 25                        France NaN                       Croatia
 26                           NaN NaN                           NaN
 27                           NaN NaN                           NaN
 28                           NaN NaN                           NaN
 29                           NaN NaN                           NaN

                               9                             10  11  \
 0            Third place playoff           Third place playoff NaN
 1                          Score                  Fourth place NaN
 2                         –[n 1]                    Yugoslavia NaN
 3                            3–2                       Austria NaN
 4                            4–2                        Sweden NaN
 5   Not held due to World War II  Not held due to World War II NaN
 6   Not held due to World War II  Not held due to World War II NaN
 7                       3–1[n 2]                         Spain NaN
 8                            3–1                       Uruguay NaN
 9                            6–3                  West Germany NaN
 10                           1–0                    Yugoslavia NaN
 11                           2–1                  Soviet Union NaN
 12                           1–0                       Uruguay NaN
 13                           1–0                        Brazil NaN
 14                           2–1                         Italy NaN
 15                           3–2                        France NaN
 16                  4–2 (a.e.t.)                       Belgium NaN
 17                           2–1                       England NaN
 18                           4–0                      Bulgaria NaN
 19                           2–1                   Netherlands NaN
 20                           3–2                   South Korea NaN
 21                           3–1                      Portugal NaN
 22                           3–2                       Uruguay NaN
 23                           3–0                        Brazil NaN
 24                           2–0                       England NaN
 25                           2–1                       Morocco NaN
 26                           NaN                           NaN NaN
 27                           NaN                           NaN NaN
 28                           NaN                           NaN NaN
 29                           NaN                           NaN NaN

               12
 0   No. of teams
 1   No. of teams
 2             13
 3             16
 4             15
 5              –
 6              –
 7             13
 8             16
 9             16
 10            16
 11            16
 12            16
 13            16
 14            16
 15            24
 16            24
 17            24
 18            24
 19            32
 20            32
 21            32
 22            32
 23            32
 24            32
 25            32
 26            48
 27            48
 28            48
 29           NaN  ,
                Team                            Titles  \
 0            Brazil  5 (1958, 1962, 1970, 1994, 2002)
 1          Germany1      4 (1954, 1974 *, 1990, 2014)
 2             Italy      4 (1934 *, 1938, 1982, 2006)
 3         Argentina            3 (1978 *, 1986, 2022)
 4            France                  2 (1998 *, 2018)
 5           Uruguay                  2 (1930 *, 1950)
 6           England                        1 (1966 *)
 7             Spain                          1 (2010)
 8       Netherlands                               NaN
 9           Hungary                               NaN
 10  Czech Republic2                               NaN
 11           Sweden                               NaN
 12          Croatia                               NaN
 13           Poland                               NaN
 14          Austria                               NaN
 15         Portugal                               NaN
 16          Belgium                               NaN
 17    United States                               NaN
 18            Chile                               NaN
 19           Turkey                               NaN
 20          Serbia3                               NaN
 21          Russia4                               NaN
 22         Bulgaria                               NaN
 23      South Korea                               NaN
 24          Morocco                               NaN

                     Runners-up                   Third place  \
 0             2 (1950 *, 1998)                2 (1938, 1978)
 1   4 (1966, 1982, 1986, 2002)  4 (1934, 1970, 2006 *, 2010)
 2               2 (1970, 1994)                    1 (1990 *)
 3         3 (1930, 1990, 2014)                           NaN
 4               2 (2006, 2022)                2 (1958, 1986)
 5                          NaN                           NaN
 6                          NaN                           NaN
 7                          NaN                           NaN
 8         3 (1974, 1978, 2010)                      1 (2014)
 9               2 (1938, 1954)                           NaN
 10              2 (1934, 1962)                           NaN
 11                  1 (1958 *)                2 (1950, 1994)
 12                    1 (2018)                2 (1998, 2022)
 13                         NaN                2 (1974, 1982)
 14                         NaN                      1 (1954)
 15                         NaN                      1 (1966)
 16                         NaN                      1 (2018)
 17                         NaN                      1 (1930)
 18                         NaN                    1 (1962 *)
 19                         NaN                      1 (2002)
 20                         NaN                           NaN
 21                         NaN                           NaN
 22                         NaN                           NaN
 23                         NaN                           NaN
 24                         NaN                           NaN

             Fourth place  Top 4 total
 0       2 (1974, 2014 *)           11
 1               1 (1958)           13
 2               1 (1978)            8
 3                    NaN            6
 4               1 (1982)            7
 5   3 (1954, 1970, 2010)            5
 6         2 (1990, 2018)            3
 7               1 (1950)            2
 8               1 (1998)            5
 9                    NaN            2
 10                   NaN            2
 11              1 (1938)            4
 12                   NaN            3
 13                   NaN            2
 14              1 (1934)            2
 15              1 (2006)            2
 16              1 (1986)            2
 17                   NaN            1
 18                   NaN            1
 19                   NaN            1
 20        2 (1930, 1962)            2
 21              1 (1966)            1
 22              1 (1994)            1
 23            1 (2002 *)            1
 24              1 (2022)            1  ,
   Confederation  AFC  CAF  CONCACAF  CONMEBOL  OFC  UEFA  Total
 0         Teams   43   49        46        89    4   258    489
 1        Top 16    9   11        15        37    1    99    172
 2         Top 8    2    4         5        36    0   105    152
 3         Top 4    1    1         1        23    0    62     88
 4         Top 2    0    0         0        15    0    29     44
 5           4th    1    1         0         5    0    15     22
 6           3rd    0    0         1         3    0    18     22
 7           2nd    0    0         0         5    0    17     22
 8           1st    0    0         0        10    0    12     22,
     Rank             Player  Goals  Matches  Goals per game
 0      1     Miroslav Klose     16       24            0.67
 1      2            Ronaldo     15       19            0.84
 2      3        Gerd Müller     14       13            1.08
 3      4      Just Fontaine     13        6            2.17
 4      4       Lionel Messi     13       26            0.50
 5      6      Kylian Mbappé     12       14            0.86
 6      6               Pelé     12       14            0.86
 7      8      Sándor Kocsis     11        5            2.20
 8      8   Jürgen Klinsmann     11       17            0.65
 9     10        Helmut Rahn     10       10            1.00
 10    10  Gabriel Batistuta     10       12            0.83
 11    10       Gary Lineker     10       12            0.83
 12    10   Teófilo Cubillas     10       13            0.77
 13    10      Thomas Müller     10       19            0.53
 14    10      Grzegorz Lato     10       20            0.50,
    Rank National team  Goals scored
 0     1        Brazil           237
 1     2       Germany           232
 2     3     Argentina           152
 3     4        France           136
 4     5         Italy           128
 5     6         Spain           108
 6     7       England           104
 7     8   Netherlands            96
 8     9       Uruguay            89
 9    10       Hungary            87,
                  World Cup          Golden Ball  \
 0             1930 Uruguay          Not Awarded
 1               1934 Italy          Not Awarded
 2              1938 France          Not Awarded
 3              1950 Brazil          Not Awarded
 4         1954 Switzerland          Not Awarded
 5              1958 Sweden          Not Awarded
 6               1962 Chile          Not Awarded
 7             1966 England          Not Awarded
 8              1970 Mexico          Not Awarded
 9        1974 West Germany          Not Awarded
 10          1978 Argentina          Not Awarded
 11              1982 Spain          Paolo Rossi
 12             1986 Mexico       Diego Maradona
 13              1990 Italy  Salvatore Schillaci
 14      1994 United States              Romário
 15             1998 France              Ronaldo
 16  2002 South Korea/Japan          Oliver Kahn
 17            2006 Germany      Zinedine Zidane
 18       2010 South Africa         Diego Forlán
 19             2014 Brazil         Lionel Messi
 20             2018 Russia          Luka Modrić
 21              2022 Qatar         Lionel Messi

                                           Golden Boot  Goals  \
 0                                   Guillermo Stábile      8
 1                                     Oldřich Nejedlý      5
 2                                            Leônidas      7
 3                                              Ademir      9
 4                                       Sándor Kocsis     11
 5                                       Just Fontaine     13
 6   Flórián Albert  Garrincha  Vavá  Valentin Ivan...      4
 7                                             Eusébio      9
 8                                         Gerd Müller     10
 9                                       Grzegorz Lato      7
 10                                       Mario Kempes      6
 11                                        Paolo Rossi      6
 12                                       Gary Lineker      6
 13                                Salvatore Schillaci      6
 14                     Oleg Salenko  Hristo Stoichkov      6
 15                                        Davor Šuker      6
 16                                            Ronaldo      8
 17                                     Miroslav Klose      5
 18                                      Thomas Müller      5
 19                                    James Rodríguez      6
 20                                         Harry Kane      6
 21                                      Kylian Mbappé      8

           Golden Glove  Clean sheets FIFA Young Player Award  \
 0          Not Awarded           NaN             Not Awarded
 1          Not Awarded           NaN             Not Awarded
 2          Not Awarded           NaN             Not Awarded
 3          Not Awarded           NaN             Not Awarded
 4          Not Awarded           NaN             Not Awarded
 5          Not Awarded           NaN                    Pelé
 6          Not Awarded           NaN          Flórián Albert
 7          Not Awarded           NaN       Franz Beckenbauer
 8          Not Awarded           NaN        Teófilo Cubillas
 9          Not Awarded           NaN         Władysław Żmuda

In [40]:
dflist[4]

,0,1,2,3,4,5,6,7,8,9,10,11,12
0,Ed.,Year,Hosts,NaN,Final,Final,Final,NaN,Third place playoff,Third place playoff,Third place playoff,NaN,No. of teams
1,Ed.,Year,Hosts,NaN,Champions,Score,Runners-up,NaN,Third place,Score,Fourth place,NaN,No. of teams
2,1,1930,Uruguay,NaN,Uruguay,4–2,Argentina,NaN,United States,–[n 1],Yugoslavia,NaN,13
3,2,1934,Italy,NaN,Italy,2–1 (a.e.t.),Czechoslovakia,NaN,Germany,3–2,Austria,NaN,16
4,3,1938,France,NaN,Italy,4–2,Hungary,NaN,Brazil,4–2,Sweden,NaN,15
5,–,1942,NaN,NaN,Not held due to World War II,Not held due to World War II,Not held due to World War II,NaN,Not held due to World War II,Not held due to World War II,Not held due to World War II,NaN,–
6,–,1946,NaN,NaN,Not held due to World War II,Not held due to World War II,Not held due to World War II,NaN,Not held due to World War II,Not held due to World War II,Not held due to World War II,NaN,–
7,4,1950,Brazil,NaN,Uruguay,2–1[n 2],Brazil,NaN,Sweden,3–1[n 2],Spain,NaN,13
8,5,1954,Switzerland,NaN,West Germany,3–2,Hungary,NaN,Austria,3–1,Uruguay,NaN,16
9,6,1958,Sweden,NaN,Brazil,5–2,Sweden,NaN,France,6–3,West Germany,NaN,16
10,7,1962,Chile,NaN,Brazil,3–1,Czechoslovakia,NaN,Chile,1–0,Yugoslavia,NaN,16
11,8,1966,England,NaN,England,4–2 (a.e.t.),West Germany,NaN,Portugal,2–1,Soviet Union,NaN,16
12,9,1970,Mexico,NaN,Brazil,4–1,Italy,NaN,West Germany,1–0,Uruguay,NaN,16
13,10,1974,West Germany,NaN,West Germany,2–1,Netherlands,NaN,Poland,1–0,Brazil,NaN,16
14,11,1978,Argentina,NaN,Argentina,3–1 (a.e.t.),Netherlands,NaN,Brazil,2–1,Italy,NaN,16
15,12,1982,Spain,NaN,Italy,3–1,West Germany,NaN,Poland,3–2,France,NaN,24
16,13,1986,Mexico,NaN,Argentina,3–2,West Germany,NaN,France,4–2 (a.e.t.),Belgium,NaN,24
17,14,1990,Italy,NaN,West Germany,1–0,Argentina,NaN,Italy,2–1,England,NaN,24
18,15,1994,United States,NaN,Brazil,0–0 (a.e.t.) (3–2 p),Italy,NaN,Sweden,4–0,Bulgaria,NaN,24
19,16,1998,France,NaN,France,3–0,Brazil,NaN,Croatia,2–1,Netherlands,NaN,32
20,17,2002,South Korea Japan,NaN,Brazil,2–0,Germany,NaN,Turkey,3–2,South Korea,NaN,32
21,18,2006,Germany,NaN,Italy,1–1 (a.e.t.) (5–3 p),France,NaN,Germany,3–1,Portugal,NaN,32
22,19,2010,South Africa,NaN,Spain,1–0 (a.e.t.),Netherlands,NaN,Germany,3–2,Uruguay,NaN,32
23,20,2014,Brazil,NaN,Germany,1–0 (a.e.t.),Argentina,NaN,Netherlands,3–0,Brazil,NaN,32
24,21,2018,Russia,NaN,France,4–2,Croatia,NaN,Belgium,2–0,England,NaN,32
25,22,2022,Qatar,NaN,Argentina,3–3 (a.e.t.) (4–2 p),France,NaN,Croatia,2–1,Morocco,NaN,32
26,23,2026,Canada Mexico United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,48
27,24,2030,Morocco Portugal Spain[n 3],NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,48
28,25,2034,Saudi Arabia,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,48
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
# From Excel

In [46]:
df = pd.read_excel("empdata.xlsx",sheet_name='Pune','HYD','Chennai')

SyntaxError: positional argument follows keyword argument (1199499138.py, line 1)

In [44]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune